# ДЗ на 4.12 Тема 7: "Прогнозирование значений эндогенной переменной,
# проверка её адекватности и ошибки спецификации"
# Задание 2

#1
RSS_1 <- 60
RSS_2 <- 10

k_1 <- 2
k_2 <- 4
n <- 55

F_statistic <- (RSS_1-RSS_2) / (k_2 - k_1) / (RSS_2) / (n-k_2); F_statistic
qf(0.95, k_2-k_1, n-k_2)



#2
RSS <- 20.8
RSS_1 <- 14.0
RSS_2 <- 2.0
n <- 55
n1 <- 16
n2 <- 6
k <- 3

F <- ((RSS - (RSS_1 + RSS_2)) / (RSS_1 + RSS_2)) * ((n1 + n2 - 2*(k+1)) / (k + 1)); F
qf(0.95,k+1,n1+n2-2*(k+1))


#3
Y <- 2.5
X <- 30
n <- 5
Se <- 1.5
T_table <- 3

Se <- c(1.5, 0.05)
B <- c(-2, 0.14)


ci_lower <- B - Se * qt(0.975, df = 3)
ci_upper <- B + Se * qt(0.975, df = 3)